#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.sc_bucket_angular.aws_s3_bucket_object.css["styles.09e2c710755c8867a460.css"] will be created
+ resource "aws_s3_bucket_object" "css" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "text/css"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "styles.09e2c710755c8867a460.css"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/styles.09e2c710755c8867a460.css"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.index will be updated in-place
~ resource "aws_s3_bucket_object" "index" {
        acl           = "public-read"
        bucket        = "sc-staging.steins.fr"
        content_type  = "text/html"
      ~ etag          = "15f6a59416c1643bda04065fe571ce96" -> "67c003fab6dd7871041c45808281a4d7"
        force_destroy = false
        id            = "index.html"
        key           = "index.html"
        metadata      = {}
        source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/index.html"
        storage_class = "STANDARD"
        tags          = {}
      + version_id    = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["main-es2015.8d4bd2db64a21684f9f4.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "938adeaafe95d87cf7b249783375d5cc" -> null
      - force_destroy = false -> null
      - id            = "main-es2015.8d4bd2db64a21684f9f4.js" -> null
      - key           = "main-es2015.8d4bd2db64a21684f9f4.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/main-es2015.8d4bd2db64a21684f9f4.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["main-es2015.deb243e74b43bae828eb.js"] will be created
+ resource "aws_s3_bucket_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "application/javascript"
      + etag                   = "5c1f12643b772d893b41b9b481f0ee02"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main-es2015.deb243e74b43bae828eb.js"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/main-es2015.deb243e74b43bae828eb.js"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["main-es5.8d4bd2db64a21684f9f4.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "1cdccb970da32e65f5669b0b24978a4f" -> null
      - force_destroy = false -> null
      - id            = "main-es5.8d4bd2db64a21684f9f4.js" -> null
      - key           = "main-es5.8d4bd2db64a21684f9f4.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/main-es5.8d4bd2db64a21684f9f4.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["main-es5.deb243e74b43bae828eb.js"] will be created
+ resource "aws_s3_bucket_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "application/javascript"
      + etag                   = "19676f42679823290d39cf353c01bef2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main-es5.deb243e74b43bae828eb.js"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/main-es5.deb243e74b43bae828eb.js"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["polyfills-es2015.8185e5e5f5dddb0c620b.js"] will be created
+ resource "aws_s3_bucket_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "application/javascript"
      + etag                   = "18711c9188c9c9051ebc71833933a6f7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "polyfills-es2015.8185e5e5f5dddb0c620b.js"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/polyfills-es2015.8185e5e5f5dddb0c620b.js"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["polyfills-es2015.f620a0e2e9096948e75f.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "b48c92ea0ae8e77e7ad50965f5409e3f" -> null
      - force_destroy = false -> null
      - id            = "polyfills-es2015.f620a0e2e9096948e75f.js" -> null
      - key           = "polyfills-es2015.f620a0e2e9096948e75f.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/polyfills-es2015.f620a0e2e9096948e75f.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["polyfills-es5.907d25e3a51337fcb0f1.js"] will be created
+ resource "aws_s3_bucket_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "application/javascript"
      + etag                   = "cd594e02ab63f060cf3a8df423f5b523"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "polyfills-es5.907d25e3a51337fcb0f1.js"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/polyfills-es5.907d25e3a51337fcb0f1.js"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["polyfills-es5.faa55383f801c3916343.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "55bf2ae78d31ee4c98ec6cfd8d1f992a" -> null
      - force_destroy = false -> null
      - id            = "polyfills-es5.faa55383f801c3916343.js" -> null
      - key           = "polyfills-es5.faa55383f801c3916343.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/polyfills-es5.faa55383f801c3916343.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["runtime-es2015.bf83fefcacda138fd53d.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "677656e2a697e641276f4565aa5cc7c8" -> null
      - force_destroy = false -> null
      - id            = "runtime-es2015.bf83fefcacda138fd53d.js" -> null
      - key           = "runtime-es2015.bf83fefcacda138fd53d.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/runtime-es2015.bf83fefcacda138fd53d.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["runtime-es2015.ebb27210415390383473.js"] will be created
+ resource "aws_s3_bucket_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "application/javascript"
      + etag                   = "1244d3f2f28ecc6619157927aca95200"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "runtime-es2015.ebb27210415390383473.js"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/runtime-es2015.ebb27210415390383473.js"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["runtime-es5.bf83fefcacda138fd53d.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "03ec8be24610043d5ab7e7667e16dd66" -> null
      - force_destroy = false -> null
      - id            = "runtime-es5.bf83fefcacda138fd53d.js" -> null
      - key           = "runtime-es5.bf83fefcacda138fd53d.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/runtime-es5.bf83fefcacda138fd53d.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["runtime-es5.ebb27210415390383473.js"] will be created
+ resource "aws_s3_bucket_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "sc-staging.steins.fr"
      + content_type           = "application/javascript"
      + etag                   = "1244d3f2f28ecc6619157927aca95200"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "runtime-es5.ebb27210415390383473.js"
      + server_side_encryption = (known after apply)
      + source                 = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/runtime-es5.ebb27210415390383473.js"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["styles-es2015.5ed1d76fef253b609d69.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "b22a0c707f15b297c86700d39738c8dd" -> null
      - force_destroy = false -> null
      - id            = "styles-es2015.5ed1d76fef253b609d69.js" -> null
      - key           = "styles-es2015.5ed1d76fef253b609d69.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/styles-es2015.5ed1d76fef253b609d69.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["styles-es5.5ed1d76fef253b609d69.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "f1bc5a274488ac9dd0390f0be656b968" -> null
      - force_destroy = false -> null
      - id            = "styles-es5.5ed1d76fef253b609d69.js" -> null
      - key           = "styles-es5.5ed1d76fef253b609d69.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/styles-es5.5ed1d76fef253b609d69.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["vendor-es2015.f3dc686619d9b681a50b.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "c6a77d9df577f6a54626042699dfc58c" -> null
      - force_destroy = false -> null
      - id            = "vendor-es2015.f3dc686619d9b681a50b.js" -> null
      - key           = "vendor-es2015.f3dc686619d9b681a50b.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/vendor-es2015.f3dc686619d9b681a50b.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

  # module.sc_bucket_angular.aws_s3_bucket_object.js["vendor-es5.f3dc686619d9b681a50b.js"] will be destroyed
- resource "aws_s3_bucket_object" "js" {
      - acl           = "public-read" -> null
      - bucket        = "sc-staging.steins.fr" -> null
      - content_type  = "application/javascript" -> null
      - etag          = "14f6bf5bc317eca74a92f4a841268497" -> null
      - force_destroy = false -> null
      - id            = "vendor-es5.f3dc686619d9b681a50b.js" -> null
      - key           = "vendor-es5.f3dc686619d9b681a50b.js" -> null
      - metadata      = {} -> null
      - source        = "modules/aws-bucket-angular/../../../application/frontend/game-app/dist/synchronous-chess/vendor-es5.f3dc686619d9b681a50b.js" -> null
      - storage_class = "STANDARD" -> null
      - tags          = {} -> null
    }

Plan: 7 to add, 1 to change, 10 to destroy.
```

</details>

*Workflow: `Angular CI Pull request Game App`, Action: `hashicorpterraform-github-actions3`*